app/Controllers/Admin/Profile.php

    public function index()
    {
        $page = new \stdClass();
        $page->title = 'Dashboard';

        // Start the session and check if it's valid
        $session = session();

        // Load the MembersModel
        $membersModel = new MembersModel();
        $username = session()->get('username');
        // $studentId = session()->get('student_id');
        // Fetch student details
        $adminData = $membersModel->where('username', $username)->first();
---
SELECT *
FROM `members`
WHERE `username` = 'admin'
 LIMIT 1

    public function ProfileSettings()
    {
        $membersModel = new MembersModel();
        $CountryModel = new CountryModel();
        $this->viewBag = [
            'AdminData' => $membersModel->where('username', session('username'))->first(),
            'CountryList' => $CountryModel->findAll(),
            'title' => 'Profile',
            'pagetitle' => 'All Profile are made here'
        ];
---
SELECT *
FROM `members`
WHERE `username` = 'admin'
 LIMIT 1
SELECT *
FROM `countries`