app/Controllers/Admin/Profile.php

SELECT *
FROM `members`
WHERE `username` = 'Ibrahim'
 LIMIT 1
SELECT *
FROM `countries`
---
    public function ProfileSettings()
    {
        $membersModel = new MembersModel();
        $CountryModel = new CountryModel();
        $this->viewBag = [
            'AdminData' => $membersModel->where('username', session('username'))->first(),
            'CountryList' => $CountryModel->findAll(),
            'title' => 'Profile',
            'pagetitle' => 'All Profile are made here'
        ];