app/Controllers/Admin/PropertyController.php

    public function create()
    {
        $data['features'] = $this->featureModel->findAll();
        $data['categories'] = $this->catModel->findAll();
        $data['locations'] = $this->locModel->findAll();
---
SELECT *
FROM `features`
SELECT *
FROM `categories`
SELECT *
FROM `locations`

    public function store()
    {
        // Validate form input
        $validation = \Config\Services::validation();
        $validation->setRules($this->propertyModel->validationRules);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
---
SELECT *
FROM `properties`