app/Controllers/Admin/UserController.php

     public function bookinglist()
     {
           // Retrieve property details
           $BookingModel = new BookingModel();
         $userId = session()->get('user_id');
         $data['bookings'] = $BookingModel->findAll();
---
SELECT *
FROM `bookings`

     public function PaymentVerified($id)
     {
         // Retrieve the agent by its ID
         $booking = $this->bookingModel->find($id);
         $username = session()->get('username');

         // Check if the agent exists
         if (!$booking) {
             return redirect()->back()->with('error', 'booking not found');
         }

         // Toggle the payment status
         $newStatus = ($booking['payment_status'] == 'paid') ? 'pending' : 'paid';

         // Update the agent record
         $data = [
             'payment_status' => $newStatus,
             'status' => 'confirmed',
             'change_time' => date('Y-m-d H:i:s'),
             'changed_by' => $username,
         ];

         $updated = $this->bookingModel->update($booking['id'], $data);
---
SELECT *
FROM `bookings`
WHERE `bookings`.`id` = '32'
UPDATE `bookings` SET `payment_status` = 'paid', `status` = 'confirmed', `change_time` = '2025-03-02 16:32:29', `changed_by` = 'admin807', `updated_at` = '2025-03-02 16:32:29'
WHERE `bookings`.`id` IN ('32')