app/Controllers/Apartment.php

SELECT *
FROM `apartment`
---
    public function index()
    {
        // $apartmentModel = new ApartmentModel();
        // $apartment = $apartmentModel -> findAll();

        $apartmentModel = new ApartmentModel();
        $type = $this->request->getGet('type');

        if ($type) {
            // Fetch apartments filtered by type
            $apartment = $apartmentModel->where('type', $type)->findAll();
        } else {
            // Fetch all apartments if no type filter is applied
            $apartment = $apartmentModel->findAll();