app/Controllers/Apartment.php

    public function ApartmentView($prop_url)
{
    $propertyModel = new PropertyModel();
    $Model = new SettingsModel();
    $page = new \stdClass();
    $page->title = 'Apartment Details - Service Apartment';

    $property = $propertyModel->getPropertyByUrl($prop_url);

    if (!$property) {
        return redirect()->to('/properties')->with('error', 'Property not found.');
    }
    $settingsData = $Model->first();
---
SELECT *
FROM `settings`
 LIMIT 1