app/Models/PropertyModel.php

    public function getPropertiesWithDetails()
    {
        return $this->select('
                properties.*,
                agents.name AS agent_name, agents.username AS agent_username, agents.email AS agent_email, agents.phone AS agent_phone,
                agents.address AS agent_address, agents.govt_id AS agent_govt_id, agents.company_name AS agent_company,
                agents.photo AS agent_photo, agents.status AS agent_status, agents.paid AS agent_paid,
                categories.name AS category_name,
                locations.city AS location_city, locations.state AS location_state, locations.country AS location_country,
                GROUP_CONCAT(DISTINCT property_images.image_url) AS images,
                GROUP_CONCAT(DISTINCT features.name) AS features
            ')
            ->join('agents', 'agents.id = properties.user_id', 'left')  // Join Agents Table
            ->join('categories', 'categories.id = properties.category_id', 'left')  // Join Categories Table
            ->join('locations', 'locations.id = properties.location_id', 'left')  // Join Locations Table
            ->join('property_images', 'property_images.property_id = properties.id', 'left')  // Join Property Images
            ->join('property_features', 'property_features.property_id = properties.id', 'left')  // Join Property Features
            ->join('features', 'features.id = property_features.feature_id', 'left')  // Join Features Table
            ->groupBy('properties.id')  // Ensure unique property rows
            ->findAll();
---
SELECT `properties`.*, `agents`.`name` AS `agent_name`, `agents`.`username` AS `agent_username`, `agents`.`email` AS `agent_email`, `agents`.`phone` AS `agent_phone`, `agents`.`address` AS `agent_address`, `agents`.`govt_id` AS `agent_govt_id`, `agents`.`company_name` AS `agent_company`, `agents`.`photo` AS `agent_photo`, `agents`.`status` AS `agent_status`, `agents`.`paid` AS `agent_paid`, `categories`.`name` AS `category_name`, `locations`.`city` AS `location_city`, `locations`.`state` AS `location_state`, `locations`.`country` AS `location_country`, GROUP_CONCAT(DISTINCT property_images.image_url) AS images, GROUP_CONCAT(DISTINCT features.name) AS features
FROM `properties`
LEFT JOIN `agents` ON `agents`.`id` = `properties`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `properties`.`category_id`
LEFT JOIN `locations` ON `locations`.`id` = `properties`.`location_id`
LEFT JOIN `property_images` ON `property_images`.`property_id` = `properties`.`id`
LEFT JOIN `property_features` ON `property_features`.`property_id` = `properties`.`id`
LEFT JOIN `features` ON `features`.`id` = `property_features`.`feature_id`
GROUP BY `properties`.`id`

    public function getPropertyByUrl($prop_url)
{
    return $this->select('
            properties.*,
            agents.name AS agent_name, agents.username AS agent_username, agents.email AS agent_email, agents.phone AS agent_phone,
            agents.address AS agent_address, agents.govt_id AS agent_govt_id, agents.company_name AS agent_company,
            agents.photo AS agent_photo, agents.status AS agent_status, agents.paid AS agent_paid,
            categories.name AS category_name,
            locations.city AS location_city, locations.state AS location_state, locations.country AS location_country,
            GROUP_CONCAT(DISTINCT property_images.image_url) AS images,
            GROUP_CONCAT(DISTINCT features.name) AS features
        ')
        ->join('agents', 'agents.id = properties.user_id', 'left')
        ->join('categories', 'categories.id = properties.category_id', 'left')
        ->join('locations', 'locations.id = properties.location_id', 'left')
        ->join('property_images', 'property_images.property_id = properties.id', 'left')
        ->join('property_features', 'property_features.property_id = properties.id', 'left')
        ->join('features', 'features.id = property_features.feature_id', 'left')
        ->where('properties.prop_url', $prop_url)
        ->groupBy('properties.id')
        ->first();  // Fetch only one record
---
SELECT `properties`.*, `agents`.`name` AS `agent_name`, `agents`.`username` AS `agent_username`, `agents`.`email` AS `agent_email`, `agents`.`phone` AS `agent_phone`, `agents`.`address` AS `agent_address`, `agents`.`govt_id` AS `agent_govt_id`, `agents`.`company_name` AS `agent_company`, `agents`.`photo` AS `agent_photo`, `agents`.`status` AS `agent_status`, `agents`.`paid` AS `agent_paid`, `categories`.`name` AS `category_name`, `locations`.`city` AS `location_city`, `locations`.`state` AS `location_state`, `locations`.`country` AS `location_country`, GROUP_CONCAT(DISTINCT property_images.image_url) AS images, GROUP_CONCAT(DISTINCT features.name) AS features
FROM `properties`
LEFT JOIN `agents` ON `agents`.`id` = `properties`.`user_id`
LEFT JOIN `categories` ON `categories`.`id` = `properties`.`category_id`
LEFT JOIN `locations` ON `locations`.`id` = `properties`.`location_id`
LEFT JOIN `property_images` ON `property_images`.`property_id` = `properties`.`id`
LEFT JOIN `property_features` ON `property_features`.`property_id` = `properties`.`id`
LEFT JOIN `features` ON `features`.`id` = `property_features`.`feature_id`
WHERE `properties`.`prop_url` = '4-bedroom-bungalow'
GROUP BY `properties`.`id`
ORDER BY `properties`.`id` ASC
 LIMIT 1