app/Controllers/Agents/PaymentController.php

    public function index()
    {
        $userId = session()->get('user_id');
        $data['properties'] = $this->propertyModel->where('user_id', $userId)->findAll();
---
SELECT *
FROM `properties`
WHERE `user_id` = '4'