app/Controllers/Agents/PropertyController.php

SELECT *
FROM `properties`
WHERE `user_id` = '4'
---
    public function index()
    {
        $userId = session()->get('user_id');
        $data['properties'] = $this->propertyModel->where('user_id', $userId)->findAll();

SELECT *
FROM `features`
SELECT *
FROM `categories`
SELECT *
FROM `locations`
---
    public function create()
    {
        $data['features'] = $this->featureModel->findAll();
        $data['categories'] = $this->catModel->findAll();
        $data['locations'] = $this->locModel->findAll();