app/Controllers/Users/BookingsController.php

SELECT *
FROM `bookings`
WHERE `user_id` = '2'
---
    public function index()
    {
          // Retrieve property details
          $BookingModel = new BookingModel();
        $userId = session()->get('user_id');
        $data['bookings'] = $BookingModel->where('user_id', $userId)->findAll();

SELECT *
FROM `bookings`
WHERE `bookings`.`id` = '32'
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
public function success($bookingId)
{
    // Create a page object for the title
    $page = new \stdClass();
    $page->title = 'Pay Out ';

    // Load the models
    $bookingModel = new BookingModel();
    $userModel = new UsersModel(); // Ensure you have a UserModel

    // Fetch booking details by ID
    $booking = $bookingModel->find($bookingId);

    if (!$booking) {
        // Handle case where booking is not found
        return redirect()->to('bookings')->with('error', 'Booking not found');
    }

    // Fetch user details using the user_id from the booking
    $user = $userModel->find($booking['user_id']);