app/Controllers/Users/Profile.php

    public function index($id = null)
    {
        $page = new \stdClass();
        $page->title = 'Dashboard';

        // Start the session and check if it's valid
        $session = session();

        // Load the UsersModel
        $UsersModel = new UsersModel();
        $username = session()->get('username');
        // $studentId = session()->get('student_id');
        // Fetch student details
        $userData = $UsersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'ibry804'
 LIMIT 1